:PROPERTIES:
:ID:       4ea2e0d3-f2f4-4083-b3e3-7ea638872d56
:END:
#+title: Fundamentals of Data Analysis - Class Notes
#+HTML_HEAD: <link rel="stylesheet" href="https://alves.world/org.css" type="text/css">
#+HTML_HEAD: <style type="text/css" media="print"> body { visibility: hidden; display: none }  </style>
#+HTML_HEAD: <style type="text/css"> .sideline {    /* only if on a wide screen */    @media (min-width: 768px) {        border-left: 1px solid #ddd;        position: absolute;        left: 2em;        width: 20vw;    }} </style>
#+OPTIONS: toc:2
#+HTML_HEAD: <script src="https://alves.world/tracking.js" ></script>
#+HTML_HEAD: <script src="anti-cheat.js"></script>
#+HTML: <script data-name="BMC-Widget" data-cfasync="false" src="https://cdnjs.buymeacoffee.com/1.0.0/widget.prod.min.js" data-id="velocitatem24" data-description="Support me on Buy me a coffee!" data-message="" data-color="#5F7FFF" data-position="Right" data-x_margin="18" data-y_margin="18"></script>
#+HTML: <script>setTimeout(() => {alert("Finding this useful? Consider buying me a coffee! Bottom right cornner :) Takes just a few seconds")}, 60*1000);_paq.push(['trackEvent', 'Exposure', 'Exposed to beg']);</script>

#+begin_src ipython :session test
x = [1,2,3,4,5]
y = [1,4,9,16,25]
print([a-b for a,b in zip(x,y)])
#+end_src

*New* search feature! Make use of the amazing [[https://en.wikipedia.org/wiki/Approximate_string_matching][fuzzy search]] algorithm. Just type in the search box and it will find the closest match in the page. Hit =Enter= to jump to the next match. Lmk if it doesn't work for you.
#+HTML: <input id="search" type="text" placeholder="Search" /> <span id="resultCount"></span>
#+HTML: <script src="https://alves.world/fuzzy.js"></script>


Useful Resources:
+ [[https://seeing-theory.brown.edu/frequentist-inference/index.html#section1][Seeing Theory - Frequentist Inference]]
+ [[https://online.stat.psu.edu/stat415/][Penn State Notes]]

** =np.where()=
The =np.where()= function is a vectorized version of the =if= statement. It takes a condition, a value to return if the condition is =True=, and a value to return if the condition is =False=. Here is an example:

#+begin_src ipython :results output :exports both
  import numpy as np

  # Create a NumPy array
  arr = np.array([1, 2, 3, 4, 5])

  # Use np.where() to replace all values less than 3 with 0
  res = np.where(arr < 3, 0, arr)
  print(res)
#+end_src

#+RESULTS:
: [0 0 3 4 5]

** Sorting
We can use the =.sort_values()= method to sort a DataFrame by one or more columns. Here is an example:

#+begin_src ipython :results output :exports both
  import pandas as pd
  # Create a DataFrame from a dictionary
  df = pd.DataFrame({'name': ['John', 'Jane', 'Joe'],
                    'age': [34, 25, 67],
                    'height': [1.78, 1.65, 1.89]})

  # Sort the DataFrame by age
  print(df.sort_values('age'))
#+end_src

#+RESULTS:
:    name  age  height
: 1  Jane   25    1.65
: 0  John   34    1.78
: 2   Joe   67    1.89

** Grouping
To avoid redundant filtering and aggregation, we can use the =.groupby()= method to group a DataFrame by one or more columns. Here is an example:

#+begin_src ipython :results output :exports both
  import pandas as pd
  # Create a DataFrame from a dictionary
  df = pd.DataFrame({'name': ['John', 'Jane', 'Joe'],
                    'age': [34, 25, 67],
                    'gender': ["M", "F", "M"],
                    'height': [1.78, 1.65, 1.89]})

  # Group the DataFrame by gender
  print(df.groupby('gender').describe())
  # Group the DataFrame by gender and calculate the mean of each group
  print(df.groupby('gender').mean())
  # calculate the mean age for each gender
  print(df.groupby('gender')['age'].mean())
#+end_src

#+RESULTS:
#+begin_example
         age                                ... height
       count  mean        std   min    25%  ...    min     25%    50%     75%   max
gender                                      ...
F        1.0  25.0        NaN  25.0  25.00  ...   1.65  1.6500  1.650  1.6500  1.65
M        2.0  50.5  23.334524  34.0  42.25  ...   1.78  1.8075  1.835  1.8625  1.89

[2 rows x 16 columns]
         age  height
gender
F       25.0   1.650
M       50.5   1.835
gender
F    25.0
M    50.5
Name: age, dtype: float64
#+end_example

** Estimator Bias
An estimator is unbiased only if the expected value of the estimator is equal to the population parameter. This is represented by the following formula:

\[
E(\hat{\theta}) = \theta
\]

If there is any difference, that difference is the bias of the estimator.

If $X$ is a random variable given by a *binomial* distribution, then $\hat{p} = \frac{X}{n}$ is an unbiased estimator of $p$.

We previously defined the estimate for the mean, now lets take a look at the estimate for the variance:

\[
\hat{\sigma}^2 = \frac{1}{n-1} \sum_{i=1}^{n} (x_i - \bar{x})^2
\]

This is an unbiased estimator of $\sigma^2$. This is because the expected value of the estimator is equal to the population parameter: $E(\hat{\sigma}^2) = \sigma^2$. Really? How? Well, we can use the *linearity of expectation* to show that:

\[
E(S^2)=E\left[\dfrac{\sigma^2}{n-1}\cdot \dfrac{(n-1)S^2}{\sigma^2}\right]=\dfrac{\sigma^2}{n-1} E\left[\dfrac{(n-1)S^2}{\sigma^2}\right]=\dfrac{\sigma^2}{n-1}\cdot (n-1)=\sigma^2
\]

Here it is demonstrated in ipython:

#+BEGIN_SRC ipython :results output
import numpy as np
import matplotlib.pyplot as plt

# Generate 1000 samples from a normal distribution
samples = np.random.normal(0, 1, 1000)

# Calculate the sample mean
sample_mean = np.mean(samples)

# Calculate the sample variance
sample_variance = np.var(samples, ddof=1)

# linearity of expectation
E_hat_sigma_squared = (1/(len(samples)-1)) * np.sum(np.var(samples, ddof=1))

# Print the results
print("Sample Mean: {}".format(sample_mean))
print("Sample Variance: {}".format(sample_variance))
print("E(hat(sigma)^2): {}".format(E_hat_sigma_squared))
#+END_SRC

#+RESULTS:
: Sample Mean: 0.05227371951431922
: Sample Variance: 1.0050258720852923
: E(hat(sigma)^2): 0.0010060319039892815



* Point Estimation (Python)
For ease, we will use built-in datasets from pandas, such as the iris dataset. We will use the sepal length of the iris dataset.


#+begin_src ipython :tangle yes :results output :exports both :noweb yes :session fda
  import pandas as pd
  import numpy as np
  import matplotlib.pyplot as plt
  from scipy import stats
  iris = pd.read_csv('https://raw.githubusercontent.com/mwaskom/seaborn-data/master/iris.csv')
  # craete a random sample of size 60
  sample = iris.sample(60)
#+end_src

#+RESULTS:

We will try to estimate the mean of the sepal length of the iris dataset. We will use the method of moments to estimate the mean.

#+begin_src ipython :tangle yes :results output :exports both :noweb yes :session fda
  sepal_length = iris['sepal_length']
  mean = sepal_length.mean()
  print(mean)
#+end_src

#+RESULTS:
: 5.843333333333334

We now know the actual mean of the sepal length of the iris dataset. We will now try to estimate the mean using the method of moments.

#+begin_src ipython :tangle yes :results output :exports both :noweb yes :session fda
  # \hat{\theta} = \frac{1}{n} \sum_{i=1}^{n} x_i^k
  # we use the sample
  mean = sample['sepal_length'].sum() / sample['sepal_length'].size
  print(mean)
#+end_src

#+RESULTS:
: 5.691666666666666

Now, we will try to estimate the variance using the maximum likelihood estimator.

#+begin_src ipython :tangle yes :results output :exports both :noweb yes :session fda
  iris = pd.read_csv('https://raw.githubusercontent.com/mwaskom/seaborn-data/master/iris.csv')
  # craete a random sample of size 60
  n = 10
  samples = [iris.sample(n*2) for i in range(n)]
  variances = [sample['sepal_length'].var() for sample in samples]

  # we get the probability density function for each variance
  f = [stats.norm.pdf(variances[i], iris['sepal_length'].var(), iris['sepal_length'].std()) for i in range(n)]

  # we get the log of the probability density function
  f_log = np.log(f)

  # we get the maximum likelihood estimator
  mle = variances[f_log.argmax()]

  # instead of argmax, we could use the following method using derivatives:
  # 1. we get the derivative of the log-likelihood function
  # 2. we set the derivative equal to zero
  # 3. we solve for the variance

  # we can express the estimated variance as a sum of the actual variance and the error
  print(f"Estimated variance: {mle}, Actual variance: {iris['sepal_length'].var()}")
  print("Error: ", mle - iris['sepal_length'].var())
#+end_src

#+RESULTS:
: Estimated variance: 0.680421052631579, Actual variance: 0.6856935123042507
: Error:  -0.005272459672671648

** Simple Confidence Intervals for the Mean
For ease, we will use built-in datasets from pandas, such as the iris dataset. We will use the sepal length of the iris dataset.

#+BEGIN_SRC ipython :exports both :results output :session *Python*
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from scipy import stats


iris = pd.read_csv("https://raw.githubusercontent.com/mwaskom/seaborn-data/master/iris.csv")
sepal_length = iris["sepal_length"]
print(sepal_length.head())
#+END_SRC

#+RESULTS:
: 0    5.1
: 1    4.9
: 2    4.7
: 3    4.6
: 4    5.0
: Name: sepal_length, dtype: float64

Now we have, the data. Lets create a confidence interval for the mean of the sepal length. We will use a confidence level of 95%.

#+BEGIN_SRC ipython :exports both :results output :session *Python*
interval = stats.norm.interval(0.95, loc=np.mean(sepal_length), scale=np.std(sepal_length))
print(interval)
#+END_SRC

#+RESULTS:
: (4.2257725250400755, 7.460894141626592)

We can see that the confidence interval is between 4.23 and 7.46.

** Confidence Interval for the Population Proportion
We will use the same dataset as before, but this time we will use the sepal width. We will use a confidence level of 95%. In the first example we do not approximate, we use the exact formula.

#+BEGIN_SRC ipython :exports both :results output :session *Python*
from statsmodels.stats.proportion import proportion_confint
# proportion where the sepal width is greater than 3.5
X = np.sum(iris["sepal_width"] > 3.5)
n = len(iris["sepal_width"])
p = X/n

interval = proportion_confint(X, n, alpha=0.05, method="normal")
print(interval)
#+END_SRC

#+RESULTS:
: (0.0734406885907721, 0.17989264474256125)

The =method= parameter can be either =normal= or =wilson=.
+ =normal= uses the normal approximation. We use this one if $np \geq 10$ and $n(1-p) \geq 10$.
+ =wilson= uses the Wilson score interval. If the conditions are not met, we use this one.


We can now try to approximate with the normal distribution. We will use the same confidence level of 95%.

#+BEGIN_SRC ipython :exports both :results output :session *Python*
  scale = np.sqrt(p*(1-p)/n)
  interval = stats.norm.interval(0.95, loc=p, scale=scale)
  print(interval)
#+END_SRC

#+RESULTS:
: (0.07344068859077212, 0.17989264474256123)


Now lets take a look at binomial approximation for the confidence interval. We will use the same confidence level of 95%. It is important to check if the conditions are met, that is if $np \geq 10$ and $n(1-p) \geq 10$.

#+BEGIN_SRC ipython :exports both :results output :session *Python*
# conditions test
print("np >= 10: ", n*p >= 10)
print("n(1-p) >= 10: ", n*(1-p) >= 10)
#+END_SRC

#+RESULTS:
: np >= 10:  True
: n(1-p) >= 10:  True

Now we can use the binomial approximation.

#+BEGIN_SRC ipython :exports both :results output :session *Python*
  interval = stats.binom.interval(0.95, n, p)
  print(interval)
  interval = [x/n for x in interval]
  print(interval)
#+END_SRC

#+RESULTS:
: (11.0, 27.0)
: [0.07333333333333333, 0.18]

The last step is very important. We need to divide the interval by the sample size to get the proportion interval. We can see that the interval is between 0.073 and 0.18, which is a very close approximation to the normal approximation.

** Prediction Interval for Future Values
We will use the same dataset as before, but this time we will use the petal width. We will use a confidence level of 95%. In this example we are trying to predict the future value of the petal width.

#+BEGIN_SRC ipython :exports both :results output :session *Python*
  from statsmodels.stats.weightstats import _tconfint_generic


  sample_mean = np.mean(iris["petal_width"])
  sample_std = np.std(iris["petal_width"])
  n = len(iris["petal_width"])
  alpha = 0.05

  t_score = stats.t.ppf(1-alpha/2, n-1) # t score for 95% confidence
  interval = (sample_mean - t_score*sample_std/np.sqrt(n), sample_mean + t_score*sample_std/np.sqrt(n))
  print(interval)
#+END_SRC

#+RESULTS:
: (1.0767639167319225, 1.3219027499347447)

So we can now be 95% confident that the future value of the petal width will be between 1.08 and 1.32.
How can we validate this? We can use the bootstrap method.

#+BEGIN_SRC ipython :exports both :results output :session *Python*
  from sklearn.utils import resample

  # bootstrap
  n_iterations = 1000
  n_size = int(len(iris["petal_width"]) * 0.50)
  medians = list()
  for i in range(n_iterations):
    s = resample(iris["petal_width"], n_samples=n_size)
    m = np.mean(s)
    medians.append(m)

  interval = np.percentile(medians, [2.5, 97.5])
  print(interval)
#+END_SRC

#+RESULTS:
: [1.02796667 1.36133333]






** Confidence Interval for the Population Variance
We will use the same dataset as before, but this time we will use the petal width. We will use a confidence level of 95%.

#+BEGIN_SRC ipython :exports both :results output :session *Python*
  s = np.std(iris["petal_width"])
  var = s**2
  n = len(iris["petal_width"])
  alpha = 0.05
  ucl = (n-1)*var/stats.chi2.ppf(alpha/2, n-1)
  lcl = (n-1)*var/stats.chi2.ppf(1-alpha/2, n-1)
  inteval = (lcl, ucl)
  print(interval)
#+END_SRC

#+RESULTS:
: (117.09798286232113, 184.68695493443445)


